In [1]:
import pandas as pd

students = [
    'Naomi', 'Yumi','Hinata',
    'Hana', 'Akira', 'Yuki',
    'Yudi', 'Sakura', 'Sasuke',
    'Hiroshi', 'Ken', 'Emi']
mathematics = [1, 3, 1, 3, 4, 3, 1, 9, 5, 9, 1, 2]
chemestry = [6, 5, 5, 8, 6, 6, 5, 3, 7, 8, 6, 4]
biology = [8, 7, 9, 9, 7, 7, 8, 7, 7, 7, 7, 9]
economy = [3, 2, 7, 8, 9, 9, 5, 9, 8, 6, 7, 9]
data = {
    'Students': students,
    'Mathematics':mathematics,
    'Chemestry':chemestry,
    'Biology': biology,
    'Economy': economy
}

df = pd.DataFrame(data, index = range(1,len(students)+1))
df['Final average'] = df.drop(['Students'], axis = 1).mean(axis = 1)
def show_result(grade):
    if grade>=7:
        return 'Approved'
    else:
        return 'Reproved'

df['Result'] = df['Final average'].apply(show_result)

print(df)

   Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
1     Naomi            1          6        8        3           4.50  Reproved
2      Yumi            3          5        7        2           4.25  Reproved
3    Hinata            1          5        9        7           5.50  Reproved
4      Hana            3          8        9        8           7.00  Approved
5     Akira            4          6        7        9           6.50  Reproved
6      Yuki            3          6        7        9           6.25  Reproved
7      Yudi            1          5        8        5           4.75  Reproved
8    Sakura            9          3        7        9           7.00  Approved
9    Sasuke            5          7        7        8           6.75  Reproved
10  Hiroshi            9          8        7        6           7.50  Approved
11      Ken            1          6        7        7           5.25  Reproved
12      Emi            2          4        9        9           6.00  Reproved

## students who had a math score greater than or equal to 7

In [2]:
df[df['Mathematics']>=7]

   Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
8    Sakura            9          3        7        9            7.0  Approved
10  Hiroshi            9          8        7        6            7.5  Approved

## students who scored less than 5 in Chemistry

In [3]:
df[df['Chemestry'] < 5]

   Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
8    Sakura            9          3        7        9            7.0  Approved
12      Emi            2          4        9        9            6.0  Reproved

## students who scored 8 in Biology

In [4]:
df[df['Biology']==8]

  Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
1    Naomi            1          6        8        3           4.50  Reproved
7     Yudi            1          5        8        5           4.75  Reproved

## students who scored in Economics other than 9

In [5]:
df[df['Economy']!=9]

   Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
1     Naomi            1          6        8        3           4.50  Reproved
2      Yumi            3          5        7        2           4.25  Reproved
3    Hinata            1          5        9        7           5.50  Reproved
4      Hana            3          8        9        8           7.00  Approved
7      Yudi            1          5        8        5           4.75  Reproved
9    Sasuke            5          7        7        8           6.75  Reproved
10  Hiroshi            9          8        7        6           7.50  Approved
11      Ken            1          6        7        7           5.25  Reproved

## students who had a final average lower than 5

In [6]:
df[df['Final average']<5]

  Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
1    Naomi            1          6        8        3           4.50  Reproved
2     Yumi            3          5        7        2           4.25  Reproved
7     Yudi            1          5        8        5           4.75  Reproved

## approved students

In [7]:
df[df['Result']=='Approved']

   Students  Mathematics  Chemestry  Biology  Economy  Final average    Result
4      Hana            3          8        9        8            7.0  Approved
8    Sakura            9          3        7        9            7.0  Approved
10  Hiroshi            9          8        7        6            7.5  Approved